""" 4. Пользователь вводит целое положительное число. Найдите самую
большую цифру в числе. Для решения используйте цикл while и арифметические операции. """

number = int(input("Введите число от 0 до 999:"))
number = max(str(number))
print(number)

